// Новорічний дарунок.
// - Визначити ієрархію цукерок і інших солодощів.
// - Створити декілька об'єктів-цукерок.
// - Зібрати дитячий дарунок з визначенням його ваги.
// - Провести сортування цукерок в дарунку на основі одного з параметрів.
// - Знайти цукерку в дарунку, відповідну заданому критерію параметрів.

// Для реалізації пошуку реалізувати методи розширення
// Використовувати: класи, спадкоємство, інтерфейси, поліморфізм, інкапсуляція
// Ієрархія спадкоємства має бути мінімум 4 кроки в глибину не включаючи в розрахунок самий базовий.
// Як структури для зберігання даних використовувати масиви
// У кожному класі мають бути поля і методи
// Програма повинна створювати об'єкти класів предметної області